##### taps #####
# tap homebrew-cask to install osx applications
tap "caskroom/cask"
# tap homebrew-fonts to install freely available fonts
tap "homebrew/cask-fonts"
# tap homebrew-cask-versions to install older apps
tap "homebrew/cask-versions"

##### brews #####
# GNU coreutils instead of outdated mac os defaults
brew "coreutils"
brew "moreutils"

brew "bradp/vv/vv" || true
brew "curl" || true
brew "diff-so-fancy" || true
brew "direnv" || true
brew "duti"
brew "git" || true
brew "gnupg" || true
brew "httpie" || true
brew "irssi" || true
brew "m-cli" || true
brew "nmap" || true
brew "openssl" || true
brew "pinentry-mac" || true
brew "pipenv" || true
brew "python" || true
brew "speedtest-cli" || true
brew "stow"
brew "tmux"
brew "trash" || true
brew "tree" || true
brew "watch" || true
brew "wget" || true
brew "wifi-password" || true
brew "yarn", args: ["ignore-dependencies"] || true
brew "z" || true

##### casks #####
cask "adium" || true
cask "alfred" || true
cask "cheatsheet" || true
cask "cyberduck" || true
cask "dash" || true
cask "dashlane" || true
cask "docker" || true
cask "dropbox" || true
cask "evernote" || true
cask "expressvpn" || true
cask "firefox-developer-edition"|| true
cask "fork"|| true
cask "gimp" || true
cask "google-chrome" || true
cask "iina" || true
cask "imageoptim" || true
cask "iterm2" || true
cask "kaleidoscope" || true
cask "keepingyouawake" || true
cask "kitty" || true
cask "kritta" || true
cask "macdown" || true
cask "ngrok" || true
cask "numi" || true
cask "plex-media-player" || true
cask "sequel-pro" || true
cask "slack" || true
cask "spotify" || true
cask "sublime-text" || true
cask "tower2" || true
cask "transmission" || true
cask "tunnelblick" || true
cask "vagrant" || true
cask "virtualbox" || true
cask "visual-studio-code" || true

cask "dotnet-sdk" || true
cask "mono-mdk" || true
cask "unity" || true
cask "unity-hub" || true

##### fonts #####
# install IBM Plex, an excellent modern font (https://www.ibm.com/plex/)
cask "font-ibm-plex" || true
# install Adobe Source Code Pro, an excellent mono space font for programming
cask "font-source-code-pro" || true
# install Nerd fonts for terminal
cask "font-hack-nerd-font" || true
